[
    {
        "name": "Which are the best truck tyres?",
        "details": "Trucks and other such heavy-duty transporters play a vital role in transporting heavy cargo and hundreds of passengers through the toughest of Indian roads and strenuous long-distance journeys. Hence, the tyres for these vehicles should be robust and durable for maximum comfort, and safety and to reduce the running cost.The best tyres for trucks and buses which are also high on fuel efficiency and endurance are JK Jet R Xtra Miles, JK STEEL KING, MRF MUSCLEROK, Apollo ENDUTMRACE RA and CEAT WINMILE D. Where MRF MUSCLEROK and JK Steel King are popular in the cargo and logistic segment, the JK Jet R Xtra Miles is ideal for tipper and dumper placing.Apollo ENDUTMRACE RA, on the other hand, fulfils the requirements of low operational cost while CEAT WINMILE D is an ideal option for medium and long-haul trucks on highways."
    },
    {
        "name": "Which are the best car tyres?",
        "details": "The country is one of the largest automotive market, and passenger cars hold a large chunk of space. The tyres for passenger cars are being produced for every class of buyers be it budget, mid-range or premium, everyone chooses the right tyre as per their budget and requirements.In the hatchback segment, some of the noteworthy names are JK Tyre UX Royale, MRF ZVTS, CEAT Milaze X3, and Apollo Amazer. The best options in the premium hatchbacks, compact and mid-sized sedans are MRF ZVTV, CEAT SecuraDrive, Apollo Alnac 4G and Goodyear Triplemax, while for SUVs and luxury sedans the ideal tyres are MRF Wanderer A/T, Bridgestone B290, Michelin Primacy 4ST, and Pirelli Scorpion ATR."
    },
    {
        "name": "Which are the best bike tyres?",
        "details": "Bikes are the most significant and most consumed vehicles in the Indian market and equally important is the right tyre selection, as the performance will depend a lot on the build quality. We must ensure the ideal tyre should meet the requirements of excellent grip, handling, braking, fuel efficiency and durability.Some of the best bike tyre models available in the market that are considered for ideal city commuting, include MRF Nylogrip Plus, Apollo ActiGrip R2, JK Tyre Smart Blaze BF33, CEAT Secura ZOOM F and Michelin City Pro. For mid-range and performance-oriented bikes, the best options you can have are MRF Zapper Q, JK Tyre, Smart Blaze RYDR BR43, Michelin Pilot Sporty, Metzeler Sportec M7 and Pirelli Angel City, among others."
    },
    {
        "name": "How to select the best tyre?",
        "details": "Choosing the right tyre for your vehicle can enhance overall performance. The process for selecting the best tyre involves a few easy steps. The first one is to check the right tyre size for your vehicle, the best way is to stick to the recommended size by the vehicle brand. The next move is to check what type of tyre you need tubeless or tube-type, they have their set of pros and cons Further, checking the type of tread pattern such as conventional, uni-directional and asymmetric for the driving conditions on which they will be used will be helpful. High-quality rubber compound will enhance traction and facilitate slow wear. Lastly, one must go for a trustworthy brand, which provides a long-term warranty."
    },
    {
        "name": "Which is the most popular car tyre brand in India?",
        "details": "There are several leading domestic and international tyre brands in India, including the likes of CEAT, JK Tyre, Apollo, Bridgestone, Michelin, Yokohama, Pirelli, etc., however, the MRF tops this list as it is currently the most popular brand in terms of production and sales.With ten manufacturing plants in the country and a widespread sales network, the MRF has been at the forefront of selling a wide range of tyres for almost all types of passenger cars. The tyre maker has earned several awards and recognition, including customer satisfaction, highest export, most trusted company, etc., with the quality of its products."
    },
    {
        "name": "Which is the most popular bike tyre brand in India?",
        "details": "The MRF produces tyres for all types of bikes and applications right from daily city commutes to cruisers and racing. Some of the notable bike tyres from MRF, include Nylogrip Zapper, Master X, MOTO D series, RIB, REVZ C1, and Zapper Q, among others"
    },
    {
        "name": "Which is the most popular truck tyre brand in India?",
        "details": "The country is home to one of the largest industrial and commercial hubs in the world and for that purpose light to heavy-duty vehicles are deployed to provide smooth transportation. In the truck tyre segment, there are many tyre companies, such as CEAT, JK Tyre, Apollo, Aeolus, Falken, Hankook, Maxxis, Bridgestone, etc., providing quality products. However, the one that tops the list here is the MRF."
    },
    {
        "name": "Which is the best tube or tubeless tyres?",
        "details": "Tube-type and tubeless tyres are different in design, with each suitable for different classes of buyers. The tube-type tyres are made up of soft rubber compounds, provide superior grip and are cost-effective as one needs to replace only the tube inside the tyre. However, tube-type tyres are highly vulnerable to punctures and are prone to tyre bursts due to deflation and can quickly go flat in case of a puncture.Tubeless tyres, on the other hand, are increasingly becoming the priority of the majority of manufacturers as they are less prone to punctures, high on fuel efficiency, and can be driven long-distance with a puncture. However, if the tubeless tyres go flat, the cost of repair is heavy, in fact, such tyres need complete replacement."
    },
    {
        "name": "Nitrogen vs air. Which is Better?",
        "details": "Both these air types play a significant role in tyre wearing and maintenance. While the majority of the population is still unaware of nitrogen gas and won't even easily find it nearby their place, natural or regular air, on the other hand, is freely available at every gas station or petrol pump.Nitrogen is best for racing cars and high road grip and also shines when it comes to loss of inflation pressure. However, nitrogen comes at a cost, and the infrastructure is still in the nascent stages. While Nitrogen does have some advantages over normal air, the average driver will not gain much in day-to-day driving."
    }
]